# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [21]:
import pandas as pd
import numpy as np
from pandas import DataFrame , read_csv # General syntax to import a library but no functions:
pd.__version__

'1.2.4'

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [81]:
s1 = pd.Series(np.random.randint(1,5,100))
s2 = pd.Series(np.random.randint(1,4,100))
s3 = pd.Series(np.random.randint(10000,300001,100))
s1.dtype

dtype('int32')

### Step 3. Let's create a DataFrame by joinning the Series by column

In [82]:
# df = pd.DataFrame(data=[s1,s2,s3])
tuples = list(zip(s1, s2, s3))
df = pd.DataFrame(data=tuples)
df

    0  1       2
0   2  2  138234
1   2  2  116859
2   3  3   66930
3   3  1  148150
4   4  3  148835
.. .. ..     ...
95  3  3   18362
96  2  1  108564
97  2  1  244327
98  1  3   88423
99  3  2  121377

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [83]:
df.rename(columns={0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace = True)
df

    bedrs  bathrs  price_sqr_meter
0       2       2           138234
1       2       2           116859
2       3       3            66930
3       3       1           148150
4       4       3           148835
..    ...     ...              ...
95      3       3            18362
96      2       1           108564
97      2       1           244327
98      1       3            88423
99      3       2           121377

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [102]:
bigcolumn = pd.concat([s1,s2,s3], axis=0)
bigcolumn

0          2
1          2
2          3
3          3
4          4
       ...
95     18362
96    108564
97    244327
98     88423
99    121377
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [86]:
len(df2)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [103]:
bigcolumn.reset_index(drop=True)

0           2
1           2
2           3
3           3
4           4
        ...
295     18362
296    108564
297    244327
298     88423
299    121377
Length: 300, dtype: int32